[[-0.9531, "Does Being Robbed Bother Me? Sometimes But Then At Other Times It's Like... Did Somebody Just Grab My Ass?? Cause Fuck Everyone Want To Grab My Ass And It Tickles To Much To Say No I Have To Warn Cops That I Will Get Serotonin Release If They Even Touch Me Like That Friskylol"], [-0.9443, "He admits he knew we stopped that fight but he still allowed the situation to escalate and let the arrests happen!!The discovery was  pages long!!!! cops perjure themselves over n over no mention of the gun being dropped but u can hear me scream it in st videodisgraceful "], [-0.9367, "There's a clear as day video of this event of the man obviously trying to hand something to the police or at least get them to stop to talk but apparently that doesn't matter. That line of riot cops were real threatened by a  year old man. Police are terrorists. ACAB "], [-0.9287, "Biden ordered Sergio Munoz stfu already u know damn well ull get ur ass kicked in a fight in a fist fight to Lucifer. Leave him alone and live ur own life . Ur already a disgrace to cops all over america he punked u on live tv the world chose him w his history over u ."], [-0.9167, "I want my Country back! We should make it a crime for any government official to be associated with  trumps GOP Nazis KKK Fascism White Supremist  Racist  Bad Cops Maga'  Proud Boys  Confederates any hate group!  "], [-0.913, "EXCLUSIVE: TikTok star targeted in horrific acid attack claims she had a 'bounty' on her head after she 'dropped a name' in a podcast - as cops probe links to notorious crime family  "], [-0.9118, "It has come to my attn that this user: thatdaneshguy has conflated two stories that has nothing to do with the each other and have potentially put a victim from the DMV in danger. If she ends up being murder by the cops we know who to blame for discrediting her. accountability"], [-0.9064, "If you havent committed a serious crime then why run from them and then fight them. When we make it illegal for cops to chase and disable people they are trying to arrest then all will run and fight. Yay! More criminals on the street! Sarcasm intended! "], [-0.9055, "Its not very often holy days for the  Abrahamic religions coincide but fuck this guy for doing it this weekend. And next weekend when its not a conjoined holiday Fuck him bc hell keep doing this to people. Cops know only how to put boots on and stomp people. "], [-0.9042, "Killer cops should get the death penalty "], [-0.886, "This area is full of Rohingyas  a hotbed of crime. Wonder when majority popn  our leaders will realise that these ms r serious abt their murderous agenda  our cops need to be given rights to shoot stone pelters. "], [-0.8689, "I encountered an anti vaxee irl that threatened and wished death in me and other patients at the doctors office I was in we all yelled at her to stfu and the cops took her away  shit like this happens irl but people say it's fake because we're not creeps with a camera out / "], [-0.8577, " cops in NYC what do they do attack homeless encampments for wealthy privileged white folk. This is a misuse of taxpayer funds. Destruction of property? These people have nothing and yet you want to destroy the little they have? Textbook evil.  billion dollars worth"], [-0.8555, "So the cops chase this guy all over town he hits someone they die and they charge him with murder.  Like they dont have cameras and helicopters…why play fast and the furious all over town? I never get this…"], [-0.8519, "She would have these long conversations with her dog where she would do both sides but the things she made the dog say were like...really weird and dumb. I don't know man. It was pretty fucked up. --My neighbors if the cops ever ask them about me"], [-0.8455, "CRIME SCENE: Cops bust man in violent carjacking attempt "], [-0.8288, "Nothing funnier than fucking Wisconsin morons with thin blue line Punisher logos on their trucks like bro he kills cops in canon "], [-0.8271, "French protesting : firefighters setting themselves alight and punching copsUK protesting : switching off the lights for a little bit while the government slowly strangles us for being poor."], [-0.8271, "I wonder how that girl who was screaming the n-slur from :ish am to :ish am is doing. I'm pretty sure the cops tased her cuz she was screaming and it wasn't even the I'm racist and drunk screaming from her earlier in the night."], [-0.8225, "Much as Harris  Mauser are pricks I think Id hate Mahoney. Public spirit  healthy disdain for authority aside the guys basically a sexual predator subjecting people to nasty physical attacks including cavity searches. PA  should be those two suing the shit out of the cops. "], [-0.8211, "Cops are so fucking useless and we pay them an obscene amount "], [-0.8176, "a shame it's full of evil cops prosecutors and judges "], [-0.8075, "By far and away!! that's why my dealer ever need to escape the fuckin cops- he can hit me up/ drop on in  couch with zero questions! Cop better keep his ass out my door unless there's a DAMN good warrant-  imma read that shit SO SLOW! "], [-0.802, "Khamzat says hell only fight Colby if he doesnt call the cops  "], [-0.7888, "DD's mayoral campaign is the most hamfisted I've ever seen. I cannot help but feel sorry for her even though I am against. The latest example is defending Measure B by saying it passed with % of the vote. The effect is we have no cops. And no one remembers what Measure B is!"], [-0.7717, "Police stops of Black people often filled with fear anxiety  They are  worried the cops will find the guns.."], [-0.7717, "There Will Be No Indictment For The Cops Who Killed This Man  via @YouTube"], [-0.7579, "Cops are lame. I hate every single one. I even befriended mfs for becoming a cop. "], [-0.7506, "JahangirpuriClashes erupt in Delhis Jahangirpuri area after Islamists hurl stones at a Hanuman Jayanti procession.Swords wieldedcops injuredheavy security deployed.A candlelight march in honour of Uri terrorist attack martyrs had also ledto mob fury inthe same area back"], [-0.7374, "Not to mention the police actually arrested those fools after they fled the scene. They didnt shoot at the cops or fight.. so they lived. Weird how that works. "], [-0.7351, "a man from unit  (out of ) in my apartment building just died — within minutes paramedics were in and out without a body leaving the scene — meanwhile theres a woman who was in the unit thats screaming cursing and hitting (cars  cops) to get back in"], [-0.7003, "Over  injured  arrested as Palestinians clash with cops on Al Aqsa Mosque.  "], [-0.6908, "I just saw @realjeffreyross at the Dodgers vs Rockies game. Someone call the cops his ass is missing."], [-0.6908, "The re-publicans/confederates/conservatives are for: anti-abortion executions oligarchs every corporation minimum wage (or less) white-only America cops who kill corruptible judges etc. etc."], [-0.6739, "eve called the cops on her WTF"], [-0.6669, "The other day my gay brother told me that some dude on a train platform in NYC hit him so hard for being that the entire side of his face was bruised. Forehead black eye cheek. The cops told him that they were too busy. Black immigrant gay. Nobody gives a shit."], [-0.6655, "“Didnt I tell you that you cant get your way just by saying sorry? What kind of perverted request is that the bathwater of a fairy mascot. Can I call the cops on you?"], [-0.6625, "these men are SAYING THEY ARE AFRAIDOF MEeverything about community targeting IS FIXEDIT IS UNDERSTOOD BY THE COPS AND CONTRACTORS THAT THE PROCESS IS A ONE WAY ONEALL ATTEMPTS HAVE TO BE MADE TOSUPPRESS THE VOICE OF THE TARGETA CONSPIRACY! "], [-0.6597, "Cops are a social cancer. "], [-0.6369, "Police refute claims that infant died due to cops stopping traffic in Kalyandurg- The New IndianExpress "], [-0.6369, "Police refute claims that infant died due to cops stopping traffic inKalyandurg "], [-0.6351, "Breaking in bigTerrrists attack in DelhiSleeping cells activated with swords in hand and attack on police and security also times nam@zi terrrists in the name of all@h attacked people  cops of India with stones!!"], [-0.6249, "overzealous cops are the worst"], [-0.6124, "ACAB is supposed to stand for All Cops Are Bastards not All Cops Are Baptizers. "], [-0.6124, "whenever I first saw people using acab I thought it meant assigned coochie at birth now I know it means all cops are bastards"], [-0.6114, "Dear HindusIn last  months you have seen everythingRajasthan- your hindu brothers were kicked by radical slamic terrristsMaharashtra- iftar in temple of Pune  no Hanuman Chalisa allowed in loudspeaker  arrest madeDelhi- sword injured cops  slamic terrrism!"], [-0.5994, "OnlyFans Model Seen Drenched In Blood While Being Questioned By Cops After Fatal Stabbing Of BF  SmartNews"], [-0.5927, "A black man gets shot for existing but the cops will let their friends--er Nazis harass whoever they want. @LHSLASD "], [-0.5859, "Cops was waiting  right time to do full jail insurance scams he been arranging"], [-0.5859, "I've known good criminals and bad cops. Bad priests. Honorable thieves. You can be on one side of the law or the other. But if you make a deal with somebody you keep your word."], [-0.5719, " cop shot atmultiple cops injured. This is a well planned attack : BJP statement."], [-0.5719, "I hate cops man"], [-0.5719, "This is why we hate all cops. Absolutely trash people right there "], [-0.5574, "All of these trained professionals fell for this?  If someone tipped them off that means at least one person involved knew they were criminals  not cops. Bet there are more. I just don't buy that all of these agents were innocent victims  not willful participants. "], [-0.5574, "Cops when theres no one to shoot:  "], [-0.5423, "'Defund the Police' Fever Leaves Seattle Without Cops to Investigate Sexual Assaults "], [-0.5423, "Clashes During Religious Procession in Delhi's Jahangirpuri  Cops Injured Adequate Forces Deployed Two policemen -- one sub-inspector and one constable -- have been injured in the incident. Whether or not the two recei... India by News "], [-0.5423, "She should have never been arrested.CALL A LAWYER sue the fuck outta all of them The hospitalThe copsAll of them. "], [-0.5423, "The yatras we Hindus take out - we already gather in the thousands. Why don't we equip ourselves and be prepared? The moment we stop depending on the cops is the moment from which we will be feared."], [-0.5423, "nobody:me stepping on my own grass: “oh thats where i was pinned to the ground by  grown ass cops while in handcuffs”"], [-0.5267, "im a typical punk but im dayglo abortions really..... its juust folklore like i said you know........ a cops worst nightmare"], [-0.5106, "Mystery of murdered porn star found chopped is solved after cops match tatts "], [-0.5106, "New Post: Oklahoma Thieves Impersonate Cops and Raid Several Pot Farms "], [-0.5106, "See what rogue cops from Kamukunji Police Station were caught doing in Ongata Rongai - The Kenyan police force is rotten  "], [-0.5106, "That Is Why Guy Cops Here Giggle When They Frisk Me Cause They Know That I Am Not Gay And That Is Why I Gotta Warn Them If It Tickles Too Much So Anyhow You Can't Touch The ChaseMaestre No One Can That's Expensive Fuck B'ys Where Is The Lead? That Is Cheap."], [-0.4939, "Cops r mad today huh"], [-0.4939, "In June  Buffalo cops were caught on camera gratuitously pushing a -year-old protester to the ground fracturing his skull. Two years later let's check in on what's happened to those cops. It shows how our hierarchy of consequences for police misconduct is all screwed up."], [-0.4767, "ALIVE PAYING ATTENTION TO THE WHY OTHER JUST A BODY SHOOK HANDS COPS STAY MAYBE NOT TOO LATE ONE GUST DRAGGING FUCKER BEGGING"], [-0.4767, "Teen was forced into closet and sprayed with cleaner GA cops say. Classmates charged  via @Yahoo"], [-0.4588, "I'm still getting reports that Alyssa @Liquid_Wolves is trying to find where I live and come to the house in person she's psychoticShe lives many states away and has threatened me. I will call the cops or self defend if she shows up. I am working on a restraining order for her"], [-0.4588, "in case you were wondering if that commitment to abolition is real I am a white cis lady who was sexually assaulted in my church office and no I did not call the cops because we don't call the fucking cops"], [-0.4404, "Scared Scots call Police Scotland with cops called out to 'UFOs' or 'lights in the sky'"], [-0.4388, "God Minneapolis cops are so gross "], [-0.4215, "The new Spectrum Sleepout rules - one random participant will be beaten by cops and locked in a psychiatric unit halfway through the night"], [-0.4184, "Oh no!  It's the cops!  "], [-0.4019, "Goose flies into motorcyclists head causing deadly crash in Pennsylvania cops say  via @Yahoo"], [-0.4019, "Head-on crash shuts down Route  in Hancock "], [-0.4019, "I remember when I came home from college and tried to find a hobby outside of my parents house. I bought an RC plane took it to a park… a woman called the cops on me because it caught kids attention. People are insane.  "], [-0.4019, "Is this the training y'all keep referring to when saying only cops should be carrying? Cuz this is a shitshow. Shot one of his own officers mag dumped on him just because he saw a firearm "], [-0.4019, "This is sh cuz it shows the defects of the white man breeding labs in slav Boxed hairline showing they are tamed animals and shAnd small nigR ears that can't hear cops alerts or receive a new language "], [-0.3952, "This shows a big problem with cops because he mag dumped just seeing a gun. Was it on his lap holster floor? It doesn't matter unless he was reaching or pointing it at the cop that shouldn't have happened. They're too trigger happy! "], [-0.3843, "I cant do no interviews cause the cops on my ass"], [-0.3832, "Jeffrey M. Selchick saw the same video we all did and still clear these cops after they almost killed  year old Martin Gugino … SMDH "], [-0.3818, "Cops disable UP mosques loudspeakers after BJP workers threaten to perform havan in front of it "], [-0.3818, "Dawg screaming at Az cops lmao You tryna die "], [-0.3818, "Good morning to everyone except the cops who killed PatrickLyoya. BlackLivesMatter"], [-0.3818, "Spoiled Girlfriend calls the cops on White Co-Worker what happens next will shock you | Dhar Mann"], [-0.3818, "the cops were there i tried to hide in the pool. bestie stopped me "], [-0.3612, "NJ cops  I hope he was fired and charged"], [-0.34, "Calling the Nigerian Police cops is just another level of crazy "], [-0.34, "drunk Florida man kicked out of library told cops he was jason bourne "], [-0.3182, "Muslim mob giving anger reply by Stone Pelting on cops DelhiRiots "], [-0.296, "It should stop when Cops are held accountable.I'm not holding my breath. "], [-0.296, "Stuff got said stuff got settled. No one ever called the cops.  @JaniceDean @JessieJaneDuff @bdomenech @seanmdav @Heminator @RealJamesWoods @NolteNC @KurtSchlichter @AdamBaldwin @ChrisLoesch @RichardGrenell @ggreenwald @MZHemingway @rogerkimball"], [-0.296, "We are to worried about the reaction of everyone else lowkey especially the cops. ‍ "], [-0.25, "Watching 'old enough' thinking back to how many neighbors would've called the cops on me if  year old me walked down the street alone to go to the /"], [-0.2444, "Btw he smashed a hole in her wall and shes reported him several times cops do nothing this is why women die. Even domestic avise is not taken seriously.Shes white and cops arent doing shit imagine a woc. "], [-0.2263, "It's  and cops are trying to arrest a driverless car.The car yielded to the police as intended and pulled over to the nearest safe location and put blinkers on.There was nobody to arrest tho.driverless car autonomous autonomouscar police"], [-0.1635, "“He concluded Gugino appears to have lost his balance because he was holding objects in both handshis advanced age or because he was surprised the officers used force to push him away”-This is EXACTLY why IT IS a crime not why he ruled its not. Insane  "], [-0.1027, "This “sudden dismissal” of the Herrerra case smells like a CYA for MASSIVE screwups by the hosp cops  DAs office  it smells like the DA got a call from Abbott and/or Paxton telling him that bringing this case “now” wasnt “politically expedient.” What was statute violated?  "], [-0.1027, "hope these cops are getting cheated on fr "], [-0.0772, "Yeah it's giving. Go follow @NailsByJill__ bc on god if no one cops this design bitch I WILL. "], [-0.0516, "Got detained by the cops last night lol shit was low-key fun"], [0.0258, "Ive been shot at. Multiple times and in multiple situations. Drive bys when I was at a party. Ive had shotguns held to my head by cops. Ive watched a friend get robbed at gun point. The terror you feel in those moments when seeing deranged and unhinged ppl with guns."], [0.0258, "Never realized until listening to it now between periods that the Star Wars theme song is very similar to what was produced for CHIPS in the s. How about next we have a CHIPS night to celebrate motorcycle cops?"], [0.0516, "my dreams are so swag i just had a dream that me and my bf ran over some random ass girl and we were running from the cops"], [0.0701, "Pff. You should know better than that. The cops wouldnt care whether the gvn was a toy or not. Theyd still lock you up regardless. "], [0.0772, "I want to see a spin-off of BojackHorseman  Mr. Peanutbutter in Cops and Mustards. "], [0.0772, "If you ever want to hate cops more than you already do look up “The Kissing Case” from Monroe NC"], [0.1027, "Buffalo cops who pushed protester Martin Gugino to ground cleared of wrongdoing  ACAB DemilitarizeThePolice DefundThePolice EndProgram EndNoKnockWarrants EndStopAndFrisk EndQualifiedImmunity EndAssetForfeiture"], [0.2023, "Clashes in Delhi during HanumanJayanti procession; Home Minister AmitShah speaks to top police officials "], [0.2057, "Smh… I dont understand why cops dont understand how nervous they make motherfuckers. "], [0.2144, "Look I get texting and driving is bad but yet cops over here checking their computers while driving. Ha. "], [0.2212, "Cops are fucking GOOFIES. Like Im convinced all cops have shit for brains "], [0.25, "A$$hole cops protecting Coal Baron Joe Manchins financial interests. @jcmulloy appears briefly. ManchinBlockade @WV_Rising @NoCoalNoGas @Mass @NorthShore "], [0.296, "I don't think so Daniel will probably be the MC of 'Street Man fighter' and 'Street Woman Fighter season ' plus his music solo career and probably another drama after 'Rookie cops'.I don't think he will have enough time to be mentor or judge of that show "], [0.3182, "A look at @RickCarusoLA and his time on the LA Police Commission. He helped get rid of Police Chief @BernardCParks and supported tax and fee increases for more cops.  "], [0.3182, "This was hilarious  Jimmy Kimmel Reports 'Sweet Little Snowflake' Marjorie Taylor Greene to Batman After Her Cops Threat  SmartNews"], [0.3182, "Walmart finally called the cops on me for shoplifting; Truth or Consequences New Mexico  via @FacebookWatch"], [0.3612, "I like cops who don't get shot.  Is that how its done GOP? "], [0.3612, "Orthodox like not finding cops with radars near synagogues on Saturdays (off)"], [0.3818, "Cops: Arizona man stuffed  animals in freezer some alive "], [0.3988, "I Called The Cops Last Night So Dont Worry  "], [0.4019, "Local cops arent exactly known for being smart why are y'all so pressed "], [0.4199, "They fit three cops in that cruiser?! "], [0.4404, "Cops across the country need better training "], [0.4404, "Good point. Firefighters are “firefighters” or “firemen” cops are “cops” or “police officers” nurses are “nurses” or “RNs”. We are  different names. "], [0.4767, "Ludhiana Police cops are conducting regular vigilant checks regarding the movement of vehicles on all the entry points for the security of the city.PPNightSurveillancePPInterstateNakabandiPPNakabandi "], [0.5267, "Transformative Justice is not just replacing the cops. Its a completely different worldview. "], [0.5319, "To cops/prisons/rich people… AND DEFINITELY NOT THE PENTAGON. "], [0.5483, "They really fucked up Dewey through out whole series but granted the cops werent shit when he wasnt on it anymore"], [0.5574, "cops work for the rich"], [0.5767, "SF's districts with the highest median household incomes are D and D. I am not surprised that elected officials there favor more police. When affluent people are devoted their own supervisors affluent ideas are debated at City Hall."], [0.5799, "As a reminder I adopted Millie after being rped in Texas in October and being too scared to report it to cops. I have felt more confident and safe in this world with my dog at my side. She is my everything."], [0.6103, "wholesome story! working on a song right now about our brave cops and military! "], [0.6261, "I wish this would be bigger news. @CAgovernor why was a majority of our states Covid relief given to the already overfunded police departments? Couldve been used to help people who needed it but instead went to cops. How much of this money funded the gangs in the @LASDHQ?  "], [0.6369, "i love you x i'm calling the cops."], [0.6486, "This guy mag dumped into his friend and then walked up and said “are you okay?”Lmfao cops are brilliant "], [0.6588, "See how we spent our easter weekend in jail in our immature movie available now on VimeoOnDemand! Let's just say a prank involving a sex toy went too far and the cops may have been called...Enjoy your Easter weekend laughing at usit's worth every penny..thatfatkidmovie "], [0.6808, "It's just like that episode of Benefit Street when one neighbour kept complaining  was taking photographs of all the parties the other one kept having then got huckled by the cops so they phoned the DSS to grass the other neighbour up for benefit fraud."], [0.6876, "Haha YO!! Since its coming up…Who remembers  in Boulder before it was legal and everyone would go to Farrand Field and smoke in a mob!! People would take picture and send them to the cops  Times have changed  day"], [0.6966, "See how cops needlessly escalate? Like she wasnt already concerned that her dog had just escaped. What was accomplished here? Cant reform this. "], [0.7269, "Kdrama lovers y'all should see ROOKIE COPS. Owà veryyyyyyy interesting"], [0.7322, "In Jojo all the cops are scum. One is such scum he joins the actual fucking mafia. It's a good thing he's fictional and has that face....and that voice....or I'd wanna yeet him into the sun. :)"], [0.7506, "Glad to see new better solutions being discussed for street safety. We dont need cops spending time on expired tags if violent crime is rising. Hope our leaders like @willjawando @hansriemer @tomhucker @EvanMGlass will lead the County on this "], [0.765, "Dueling banjoes get money (get money)But these pennies feel like they can cover manholesShoot hick cops Rambo Mujaheddin still onA simpler time busting Mexican brick into dimeFeeling like Pennywise what a time to be alive"], [0.7665, "Friend of a friend teaches cops how to be cops at a police academy. He doesn't wear his gear when he's on admin duty. I told him he wasn't serious about his job if he answered emails without wearing his bullet-proof vest and side-arm sixteen in the clip one in the chamber"], [0.7946, "please. stop praying for eichi!!!! you are making him too strong. he broke out of the hospital and the cops cant get him. hes too powerful"], [0.8201, "There will be no cops at pride this year. All but one of the @ABQ_Pride  board members voted to not allow @ABQPOLICE  in the Pride Parade or at Pride Fest . Do you agree with this decision?"], [0.8402, "Peaceful dora hua Musalman pelted stones at a Honuman jayanti procession in Delhi. Delhi cops being bossed by Kejriwal are fully compromised they need a strong all muscled pro-Hindu boss like Amit Shah"], [0.874, "Cops PAY ME GOOD  HELPING THEM LURE PREDATOR WAT WIN HOTEL MY DADS  HOTEL"], [0.8832, "Three Things that keep me from enjoying Masks podcasts anymore areAgeis (and general cops)The solider playbook (and general pro system shit)Teens (and assorted children)I really wish we coulda released all of super streets which featured none of that."], [0.9382, "Please can you help Jay age  with sports memorabilia to auction for @UK_COPS supporting families of fallen police officer and in memory of his hero @CCLeicsPolice.  Please can you help? @chrishoy @BritishCycling @JasonKenny @LauraKenny @SirWiggo Thank you "]]