[[-0.9778, "The only Solution to Police Terrorism and Brutality. Is Self Defense!! For Black People! When the Police Community start Toting Caskets of Dead Police who are Dealt with in a Harsh Way! Police Misconduct and Killing innocent black People will Cease to stop the Murder of us!"], [-0.9753, "Failure to hold law enforcement to account when their conduct is questionable is a failure that damages the court system which in turn damages democracy. Prosecutors who fail to stand up against police misconduct fail in their duty and fail their community. "], [-0.9709, "All the evidence of racist bent judges  The investigation into the polices handling of the Rotherham grooming gang scandal in which an estimated  young girls were sexually abused has failed to impose any criminal penalties or see any officers fired for misconduct."], [-0.9656, "Israeli forces raided the Al-Aqsa Mosque compound. It's so bad During this Holly Month ~Ramadhan. Israeli police entered in force and firing tear gas and stun grenades. Injustice Misconduct Brutalise forced Attack "], [-0.9469, "I don't know who broke the once venerable @FBI but it is so broken; is everything about it broken IDK but they sure do target people with opposing views and IGNORE people with the same views even while burning courthouses police stations etc.  "], [-0.9432, "I Have Heard Many Stories of Horrors and Atrocities in Tiananmen Square. This Was Americas Tiananmen Square. Jan  Victim of Police Brutality and Prosecutorial Misconduct - Marine James McGrewStandUpAmerica No more Injustice Corruption "], [-0.9241, "Wasnt she just an innocent paramedic  victim of police misconduct? Hell to the no! Wake up woketards! She was a misguided criminal whose questionable associations led to her tragic death!Bad company corrupts good morals!st Cor.: "], [-0.92, "Many details I wish I could share right now of these injustices- Problem is I KNOW nobody cares :( Police misconduct last straw. All stuff Bros do  me is criminal offenses + Yaphank NY Police refuse to even file reports! Domestic Violence Centers need get OrderOf Prot :("], [-0.9169, "Stalking perjury theft among  charges against Emmet County police officerBenjamin Scheevel was charged with  felony and misdemeanor offenses including numerous charges for misconduct in office unauthorized access to police records tax evasion"], [-0.9163, "[UK] A Met Police sergeant who faced allegations of breaching professional standards after he was accused of raping two women has been found guilty of gross misconduct for his abhorrent behaviour - but will not be charged with any crime "], [-0.913, "Sexual Assault has now been condoned in the police!!!!A serving Essex Police officer has been given a final written warning after he committed gross misconduct by sexually assaulting a female colleague. "], [-0.91, "Sexual misconduct by police officers is a national epidemic.  This woman thought she would be killed if she spoke up.  An investigation found over  officers lost their badges for rape and other misconduct in a -year period.  Flip MI  Blue  MI   "], [-0.91, "UK Detective Sgt David Walker who ignored Muslim rape gang activity cleared of misconduct charges  The last of  police officers to be investigated over their handling of historic allegations of child sex abuse in Rotherham has been cleared of misconduct "], [-0.9022, "Serving Essex Police officer handed final written warning after committing gross misconduct when sexual touching female colleague. Hearing was told PC Matthew Henderson student officer at the time behaved inappropriately and assaulted the victim while he was drunk and off duty "], [-0.8979, "A great comparison except no murders I Have Heard Many Stories of Horrors and Atrocities in Tiananmen Square. This Was Americas Tiananmen Square. Jan  Victim of Police Brutality and Prosecutorial Misconduct - Marine James McGrew  via @gatewaypundit"], [-0.891, "Toronto police Consts. Gurmakh Benning and Calvin Au are facing misconduct charges for allegedly failing to document the confrontation with -year-old Chadd Facey. The SIU is separately investigating Faceys death. "], [-0.886, "There needs to be a Federal Investigation inside Leon Lott and the entire S.C. Richland County Sheriff's Department. For Scandles Fraudulently offenses Fabricated Charges and crime scenes Opportunistic Theft Police Misconduct Racial Profiling violation of civil rights."], [-0.8807, "Fury over delay into ex-Cleveland Police chief's misconduct probe   Proud racist corrupt and rotten @ClevelandPolice"], [-0.875, "'Blundering' police face new probe into case of serial sex killer Stephen Port who went on year-long murder spree before he was caught. “A 'whitewash' probe clearing  police officers of misconduct will be re-opened.” via  "], [-0.872, "Police officers who are found guilty of misconduct should be named and shamed according to a commissioner.Hampshires police and crime commissioner Donna Jones recently spoke out against police officers keeping their anonymity after facing "], [-0.871, "OFFICER FOUND GUILTY IN ROUGH ARREST: A jury took just over an hour to convict a Miami-Dade officer of felony battery and official misconduct in the rough arrest of a Black woman who had called police for help. "], [-0.8689, "I Have Heard Many Stories of Horrors and Atrocities in Tiananmen Square. This Was Americas Tiananmen Square. Jan  Victim of Police Brutality and Prosecutorial Misconduct - Marine James McGrew "], [-0.8689, "I Have Heard Many Stories of Horrors and Atrocities in Tiananmen Square. This Was Americas Tiananmen Square. Jan  Victim of Police Brutality and Prosecutorial Misconduct - Marine James McGrew  via @gatewaypundit"], [-0.8689, "“I Have Heard Many Stories of Horrors and Atrocities in Tiananmen Square. This Was Americas Tiananmen Square.” - Jan  Victim of Police Brutality and Prosecutorial Misconduct Marine James McGrew"], [-0.8689, "“I Have Heard Many Stories of Horrors and Atrocities in Tiananmen Square. This Was Americas Tiananmen Square.” Jan  Victim of Police Brutality and  politics"], [-0.8587, "Of course the sane take is that everyone does wish the conclusion was different but Lyoya's continued resistance and physical violence against the officer is going to make this a very difficult case to hold as an example of police misconduct. "], [-0.8519, "A 'whitewash' probe that cleared  Scotland Yard officers of misconduct over a killer who murdered four young men is set to be re-opened the Daily Mail can reveal. "], [-0.8519, "Things need to be corrected soon to get poll numbers up.Your poll numbers are low because of:Low wage earners harmed by the lockdownslack of movement forward on Federal voting rightslack of movement on police reform and misconduct tracking Inflation  the border crisis"], [-0.851, "Over the last decade the El Paso Police Department has been plagued by incidents of abuse and misconduct including use of lethal force. Yet the majority of these victims don't get justice. It's time to hold the EPPD accountable  Sign the petition here  "], [-0.8402, "Mass. — Since creating a $ million fund to settle police misconduct suits Springfield has paid $ including  teens accusing a cop of civil rights violations  a man assaulted by the front desk cop at police HQ when he complained about a ticket "], [-0.8372, "It's a pity she did nothing to gain respect outside of her cadre.   Took the fat pension and avoided what hangs over the three below.    @GP_CCKelly "], [-0.8316, "A sheriff's deputy from Mississippi County Missouri was arrested today on charges of official misconduct and battery in connection to a  vehicle pursuit during which law enforcement firearms were fired Illinois State Police Zone  says.  "], [-0.8225, "From @MailOnline- Met Police officer Daniel Francis who killed a -year-old pedestrian after driving through a zebra crossing at three times the limit without blue lights and sirens is dismissed after gross misconduct proven. "], [-0.8225, "The UK is as inaundated with nonsensical police are crime fighting heroes rhetoric as the USA. Watching the UK media gloss over multiple incidents of gross police misconduct is disheartening."], [-0.8221, "You know I'm deeply disappointed in netflix. Fire a person for misconduct who may or may not done it. Its becoming in every company to use police of fire the person regardless of stature. Guilty before innocent. These metoo people are using this to line their pocket vs.."], [-0.8143, "Drugs Gang Violence. Prostitution. They do not. “Scare me.”  It is just something you live with.  Police Misconduct.  Sht like that.   I mean I read in the newspaper that the mass shooting in Sacramento was GANG VIOLENCE.  As I kind of thought it could be."], [-0.8126, "The Criminal Court for Corruption and Misconduct Case Region VII sentenced eight people to four-year imprisonment for the death of two police cadets in their training parachute jumps in .  @TNAMCOT"], [-0.8126, "West Virginia - $. million to be paid out in Westover police misconduct cases  The lawsuits alleged violent misconduct by Westover Police Officers ranging from use of excessive force to false arrests. "], [-0.7964, "Jury convicts Miami-Dade officer of felony battery and official misconduct in the violent arrest of a Black woman who had called police for help. "], [-0.7964, "NBCNews: Jury convicts Miami-Dade officer of felony battery and official misconduct in the violent arrest of a Black woman who had called police for help. "], [-0.7906, "Trump-Appointed Inspector Generals Office Had Sexual Misconduct Findings Removed From Report  via @Yahoo  Cuffari IG blocked investigations that SS staff proposed Re: tear gas  sting-ball grenades to disperse police brutality protesters near the WH."], [-0.7768, "Why do MPs have Investigate themselves? Police are to expected to investigate crimes. Conclusion NOT Guilty sir. WHITEWASH. Dickhead govt.  Whistleblower deeply disappointed by investigation into claims of sexual misconduct in parliament "], [-0.7717, "A California federal judge has refused to dismiss a lawsuit filed by former Oakland police chief Anne Kirkpatrick that alleges she was fired because she reported multiple instances of misconduct by members of the city's civilian police commission.  "], [-0.7717, "Pennsylvania Sexualassault Ex-school Softball Coach Charged with Sexual Assault of -Year-Old Student: Pennsylvania State Police filed sexual misconduct charges against Jane Woodside who worked at a school in Armstrong County. "], [-0.765, "Concerns raised over former chief constable doing advisory work for Police and Crime Commissioner while facing gross misconduct probe "], [-0.7626, "All I'm going to say about the attack on al-Aqsa is that it's Israeli police who did it not the IDF.Anyone familiar with abusive police officers in the US Europe and elsewhere shouldn't be too surprised to see Israeli police officers engage in misconduct."], [-0.7579, "From @DanPKeane - PC David Niven of the Met Police hit a pedestrian with his car before driving off a misconduct hearing has heard.  He failed to stop at the scene and the man was rushed to a London hospital.  Niven resigned before being dismissed.  "], [-0.7506, "Exact details of the nature of a PCs gross misconduct cannot be reported after Kent Police failed to reveal when a tribunal was taking place… "], [-0.7506, "Hampshire police officers found guilty of misconduct should be named and shamed "], [-0.7096, "The list of people who committed egregious misconduct to frame Jackie Wilson is too long for a single tweet.    A tortured false confession in  produced a decades long conspiracy among police prosecutors and others to cover it up.    innocenceconference "], [-0.6767, "The unnamed serving Cleveland Police officer is facing four charges at his gross misconduct hearing next week.   WHY THE ANONYMITY??  "], [-0.6739, "Child survivor of family violence says police 'essentially' called him a 'liar' during misconduct probe SmartNews NO Police Dept should Investigate Itself The Prosecutors Office that works with that PD Should NOT Investigate them NOT Objective  "], [-0.6486, "Married Met Police officer  who tried to pursue sexual relationships with two 'vulnerable' schoolgirls is kicked out of the force for gross misconductvia . Another groomer hiding behind a uniform. "], [-0.6486, "Monroe NorthCarolina City Council removes member AngeliaJames for misconduct after encounters with police including ordering officers to search hotel to look for killer God warned her about @theobserver -Southern politics at ChickenFriedPolitics.com-  "], [-0.6476, "IPCMC Now: End police brutality and misconduct in Malaysia - Sign the Petition!  via @Change"], [-0.6476, "IPCMC Now: End police brutality and misconduct in Malaysia - Sign the Petition!  via @Change The least at least."], [-0.6377, "It's amazing how the witnesses and complainers of police misconduct so frequently wind up dead. Why if I didn't know better it would remind me of the Mafia. "], [-0.6369, "Ligali Recommendation : A policy that enables the periodic random stop and search of mobile phones and social media accounts belonging to all serving police officers for content that would be a matter of gross misconduct if said to a member of the public. "], [-0.6369, "RIVER OAKS TYRANT FOUND  via @YouTube @YouTube is now going after people who post evidence of police misconduct and abuse… This attack on first amendment rights and on auditors is right in line with their censorship policies regarding exposing government "], [-0.6249, "A jury took just over an hour to convict a Miami-Dade officer of felony battery and official misconduct in the rough arrest of a Black woman who had called police for help.Alejandro Giraldo was suspended after cellphone video on social media in March  him tackling Dyma Loving"], [-0.6249, "I'm raising money for Fight Police Misconduct. Click to Donate:    Let's end racism and remove corrupt Police officers  from our neighborhoods. Black lives matter too ... thank you."], [-0.6249, "The loudest voices hollering about fiduciary duty today are the same that were the loudest about viral infections vaccines election tampering voting rights gender identity mental health gun laws police misconduct and international conflict.Are we seeing the problem yet?"], [-0.6249, "UK: A -year-old married muslim man who worked as a Metropolitan Police officer tried to pursue sexual relationships with two vulnerable schoolgirls (   years-old). He is kicked out of the force for gross misconduct and sentenced to  years in jail."], [-0.6124, "Police Misconduct and Brutality Survey Questions "], [-0.6124, "This officer misconduct investigation shows how police regularly get away with police brutality and other crimes it's from  why has little changed?  PoliceReform ThinBlueLine    via @YouTube"], [-0.6124, "What do false confessions biased judges sloppy police work and prosecutorial misconduct have in common? Theyre all factors that may contribute to a WrongfulConviction. Let Criminal Defense Attorney Brian Gabriel fight for your innocence today.  "], [-0.5994, "'Whitewash' probe that cleared  Scotland Yard officers of misconduct over serial killer to be re-opened  via @MailOnline"], [-0.5994, "“Members of the Legislature had no problem approving the opening of police misconduct records in  and again in . Why wont they live up to the standards they set for other institutions?” "], [-0.5875, "Public servant immunity protecting MP's and corrupt officials is simple.  Hearing held behind closed doors.  No crime recorded nor number issued - offender can be 'let go' whereas for us we'd be in front of a beak.   For example  "], [-0.5848, "Enough is Enough it's time for police officers to carry their own liability insurance just like other professions(truck drivers dentist electricianslawyers..) I don't know about you but I'm tired of my tax dollars being squandered and disregarded!|"], [-0.5719, "The hidden $. Billion-dollar cost of repeated PoliceMisconduct settlements over the past decade alone. Imagine what good could have been done with $.B for our communities instead of compensating victims abused by law enforcement. policereformnow  "], [-0.5719, "£K Merc Van   full time cops to look after the dogs CostOfLivingCrisis counciltaxrebate     Do the UK Police spend any of our money on catching criminals? @pritipatel PoliceReform  @GwentPoliceFed "], [-0.5574, "Aurora police officer fired following misconduct investigation | Local News |  - WspyNews "], [-0.5423, "Do you have any idea how much police misconduct would come to light if more cases culminated in jury trials rather than guilty pleas? The correct answer is no—none whatsoever. And that alone is a powerful argument against our current system of plea-driven mass adjudication."], [-0.5267, "A police officer was charged with grave misconduct before the Quezon City Peoples Law Enforcement Board (PLEB) the QC Public Information Office (PIO) said on Thursday April .  "], [-0.5267, "Grand Rapids police not releasing the name of the officer who killed Patrick Lyoya in April complicates tracking his past. Michigan Police disciplinary and misconduct records are also still limited to the public. My latest: "], [-0.5267, "Jurors deliberated for an hour on Thursday before convicting Miami-Dade Police Officer Alejandro Giraldo of battery and official misconduct for tackling the woman and lying about it in his police report the Miami Herald reported. "], [-0.5267, "Wiltshire police has horrifying number of misconduct cases with one officer dismissed per month "], [-0.5194, "Same as the Republicans which is why its hilarious every time a brain dead boomer says vote blue in response to police misconduct. Our Democrat president has done nothing but propose giving then MORE money "], [-0.5106, "Twitter: The New Progressive Alliance article “Widespread Police Misconduct and an Expanding Prison Population” has over  references. "], [-0.4939, " The number of officers facing misconduct cases is “horrifying” Wiltshire's police and crime commissioner (PCC) has said with the force dismissing an average of one a month "], [-0.4939, "A jury took just over an hour to convict a Miami-Dade officer of felony battery and official misconduct in the rough arrest of a Black woman who had called police for help. "], [-0.4939, "A jury took just over an hour to convict a Miami-Dade officer of felony battery and official misconduct in the rough arrest of a Black woman who had called police for help. Read More on  MiamiDadeofficer  "], [-0.4939, "In June  Buffalo cops were caught on camera gratuitously pushing a -year-old protester to the ground fracturing his skull. Two years later let's check in on what's happened to those cops. It shows how our hierarchy of consequences for police misconduct is all screwed up."], [-0.4939, "Thread about music copyrights police misconduct and a bit of legal insanity. "], [-0.4767, "A Police Car Hit a Kid on Halloween . The NYPD Is Quashing a Move to Punish the officers engaged in misconduct including hitting one boy with a car pointing a gun at another and wrongly arresting three teens. Then the NYPD intervened."], [-0.4767, "Alison Woodland proceeded to shut me up over police Misconduct and Police impersonation. Alison and Woodland has used criminal charges to save her own ass with the help of rogue Crown attorneys Who have acted as lawyers for police"], [-0.4767, "Another Nonce Married Met Police officer  who tried to pursue sexual relationships with two 'vulnerable' schoolgirls is kicked out of the force for gross misconduct"], [-0.4767, "Another police officer chasing young girls - Married Met officer  kicked out of the force for gross misconduct  via @MailOnline"], [-0.4767, "Former RSPCA QLD executives allege misconduct and corruption in unfair dismissal claims   via @couriermail"], [-0.4767, "From @BBCNews - Concerns have been raised over Mike Veale a former chief constable of Cleveland Police doing advisory work for Leicestershire PCC Rupert Matthews while facing a gross misconduct probe.   "], [-0.4767, "Married Met Police Asian officer  who tried to pursue sexual relationships with two 'vulnerable' schoolgirls is kicked out of the force for gross misconductvia  "], [-0.4767, "Muslims its what they do to little white girls.Married Met Police officer  who tried to pursue sexual relationships with two 'vulnerable' schoolgirls is kicked out of the force for gross misconductvia  "], [-0.4767, "PC Jared Gobey based in Bognor faced allegations of breaching standards of  after giving a misleading account of an incident involving a distressed man. "], [-0.4767, "PC Nathan Hind has been dismissed for gross misconduct after sexually touching two women colleagues."], [-0.4767, "Police officers who handcuffed Indigenous man granddaughter outside bank ordered suspended for misconduct "], [-0.4767, "Police officers who handcuffed Indigenous man granddaughter outside bank ordered suspended for misconduct | CBC News "], [-0.4767, "Two Vancouver police officers who handcuffed an Indigenous man and his -year-old granddaughter outside a bank ordered suspended for misconduct "], [-0.4767, "“The Philippine National Police does not tolerate any form of wrong doing or misconduct within its organization.”  WeServeAndProtect PNPKakampiMo TeamPNPKakampiMo "], [-0.4588, "Exactly what I have been saying. If the DPOs are being punished for the misdeeds of his men this police misconduct will end "], [-0.4389, "It was investigated by Durham Police who are a disciplined force. So not on the BEEBThe Met have over  misconduct hearings listedIncluding a bar fight involving + cops where they Defended Themselves with glass Bottles!They're handing MPs backdated FPNs Partygatefines "], [-0.4019, "/ Suhakam's Mohd Hishamudin Md Yunus said enforced disappearance of Joshua Hilmy  wife Ruth Sitepu was carried out w/ acquiescence of Royal Malaysian Police. He reiterated the need for Independent Police Complaints and Misconduct Commission IPCMCnow"], [-0.4019, "PC Jared Gobey has been given a final written warning after being found to have breached standards of professional behaviour.Based in Bognor PC Gobey faced allegations of breaching standards of giving a misleading account of an incident involving a "], [-0.3818, "Fight Police Misconduct "], [-0.3818, "I'm raising money for Fight Police Misconduct. Click to Donate:   GoFundMe"], [-0.3612, "A liberal utopia... Lewd misconduct indecent exposure riotous settings... Mental illness... Sexual predatory behavior.  Complacent bystanders.  No police in sight. I mean... This should be the next GOP's entire campaign video slogan.  Don't let Seattle come to you...Vote. "], [-0.3612, "What does yyc need before we come up with a new symbol for both sides as this interview suggests?  Deal with police brutality and misconduct in the CPS first. It's well documented and frankly the idea that a patch gets better billing right now is ludicrous. "], [-0.34, "Detective Constable Francois Olwage   will now face misconduct proceedings after being convicted of child sex offences following an investigation by Hertfordshire Constabulary."], [-0.34, "UK Police Discipline;  PoliceReform Police  Punishment for misconduct is;   Minor indiscretion Cake fine.  Misconduct that can't be covered up locally Reflective Practice.  Misconduct that can't be hidden (i.e. against other cops)   @ES_Humour "], [-0.3182, "The cost of police misconduct is too high—for the victims for the taxpayers. Its time for states to EndQualifiedImmunity. OCTEQI "], [-0.3182, "There has been a long struggle ― one that continues to this day ― to develop public policy that would curb police misconduct in New York City.  NYPD History"], [-0.296, "Corwallgate Both @NewquayInsp and T/Detective Chief Insp Matthew Bourne @DC_Police stated my complaint would be Recorded  Assessed by the Police (Complaints and Misconduct) Regulations .The PSD decided to use the Police Reform Act   to keep @policeconduct out of it. "], [-0.296, "Oh no   "], [-0.296, "Police took Gardner's entire server — which she claims had  police-misconduct investigations on it — when they raided her office in .  That's where the doc central to her ethics complaint came from — a doc of thoughts she made after meeting a witness "], [-0.2732, "Atten MOHAMED AMIN @IAU_KE   You are the DIRECTOR OF INTERNAL AFFAIRS and it is your duty to investigate extrajudicial killings and police misconduct.  Ahmed Rashid has extrajudicial killed over  youths but you protect him for financial reasons and Eastleigh businessmen."], [-0.2732, "BREAKING HEARING OUTCOME  police PoliceReform PoliceBrutality misconduct pc abuseofpower victim policenewsmedia news BreakingNews "], [-0.2732, "Rest assured that the “journalists” in Chicago who have built their careers on supposedly exposing police misconduct will ignore the evidence once again emerging that the FBI is the most corrupt law enforcement agency in the country."], [-0.2732, "Yes this story is srsly effed up. The tv news coverage is talking about the gross misconduct of the police over images of this kids music video. Are we supposed to be like yep well its his own fault because he's a black teen rapper? Wtf. "], [-0.2714, "I started think about it today and I came to realize my stalker Amber Nightingale from Elizabethtown Pennsylvania is going to need at least  thousand to retain two Criminal defense attorneys to represent her with my Police Misconduct Civil Rights Complaints. Wow!"], [-0.2292, "Met Police sergeant raped  women misconduct tribunal finds - but won't be charged   "], [-0.2263, "Today back in  Atty Hector E. Pineiro submits detailed documentation to District Attorney Joe. Early demanding a full investigation into allegations of misconduct by Worcester police officers citing  specific cases of wrongdoing.  "], [-0.2023, "Three children in Allegany County have been charged with sexual misconduct following an incident first reported last month police said. "], [-0.1531, "Stopping police misconduct before it ever starts .."], [-0.1506, "Why is it that whenever you get into a discussion with a Chicago police officer about police misconduct you can guarantee that within  exchanges they will say “you hate cops”? Its as if they feel they shouldnt be criticized on any account."], [-0.128, "Qualified immunity is a judicial doctrine that allows law enforcement officers and state officials to escape accountability and civil liability when they violate peoples rights. Reimagining public safety must include an end to QI. "], [-0.1226, "Wiltshire police has horrifying number of misconduct cases with one officer dismissed per month  No surprise to most other law abiding folks I dont know why the PCC is concerned after his less than honest correspondence sent to members of the public"], [-0.1027, "The Colorado attorney general has received about  complaints about police misconduct but a staffing shortage is limiting the offices ability to launch new probes.  "], [-0.0772, "Police  Fire Video: Calif. cop plays Disney music to thwart YouTubers recording: An investigation is underway after an officer apparently used copyrighted music to prevent someone from recording him   "], [-0.0772, "Transparency leads to accountability. That's why we published the Police Transparency Guide. Learn how to use California's new public access requirements to put a spotlight on police misconduct and serious use of force.  Bookmark it today. "], [-0.0516, "This week the Commission on Judicial Performance publicly admonished Long Beach judge Judith L Meyer. In May  she presided over a hearing in which the PD alleged that  Long Beach police officers engaged in misconduct regarding witnesses."], [-0.0258, "Ex-Devon and Cornwall Police Special Constable guilty of grossmisconduct "], [-0.0258, "NPF-CRU is available / to receive and resolve complaints of police misconduct from all parts of Nigeria .All cases MUST have DATE TIME and PLACE of occurrence.Call:  SMS/WhatsApp: Twitter: @PoliceNG_CRUThank you for contacting NPF-CRU"], [0.0516, "By @BBCNews - Thames Valley Police's ex- PC Oliver Perry-Smith pleaded guilty to misconduct in a public office and computer misuse. He pursued relationships with women he met through work. Our Kevin Donoghue has a professional interest in this case. "], [0.0516, "“Child survivor of family violence says police 'essentially' called him a 'liar' during misconduct probe”. Listening to children is essential factor in keeping them safer. "], [0.0762, "History repeats.   Time to change to suspension without pay to deter police misconduct? I think so. "], [0.0772, "And more evidence of why public defenders must be involved in policymaking.  yrs ago when everyone else was talking about bodycams”bad apples” etc @JusticeFwdVa wrote this bill  pitched it to electeds understanding you cant reduce police misconduct w/o limiting their power "], [0.0772, "NiskyCorruptionDMM  Duffy both acknowledged that they were Associates sharing knowledge of Town misconductProof that DMM knew Wall allegedly was intoxicated at a police sceneInstead of properly handling it DMM used it to smear Wall on social media.While a board member. "], [0.2023, "Philly police sexual misconduct case that ousted ex-Commissioner Ross gets trial date - On top of Philly news "], [0.2263, "i've worked on very complex federal civil rights cases involving police misconduct  helped the US DOJ apply the  police pattern misconduct consent decree law for its first ever such cases in U.S. history   we saw repeated official denials by police in such instances often"], [0.25, "Parks Police Secret Service Agree on New Use-of-Force Guidelines in DOJ SettlementThe settlement comes in the wake of allegations of misconduct when police cleared Lafayette Square of protesters ahead of President Donald Trumps photo op... "], [0.34, "Nice one sir this was what i told a friend yesterday when we were discussing about police misconduct. I told him if the NPF starts punishing the DPOs things will being to change "], [0.34, "Police investigating sexual misconduct allegations at Ballou High DCPS increases security "], [0.3612, "Information on Miami-Dade Florida Police Department Detective Alejandro Giraldo and his recent conviction of battery and official misconduct from the  arrest of Dyma Loving is now available.  BodyWornCamera FelonyCharges GuiltyCop "], [0.3774, "Stop praising the police for behaving lawfully. That's what they are supposed to do. Some may falter due to work pressure aaam. Saar some ila most behave like thugs. Won't change unless there is serious consequence for police misconduct. "], [0.4019, "A previous holiday with my first cousin James.  I will always be there for the Hispanic community of America.  My family is Polish Japanese and Hispanic.  My extended family is Italian.  Police misconduct also affects the Hispanic community of America.  MI "], [0.4019, "CAIR Welcomes Maryland Universitys Response to Allegations of Misconduct Against Female Muslim Students Offers Trainings to Campus Police Community "], [0.4019, "The FBI is a corrupt police state type organization designed to be an agent of the Democratic Party. Enough.  "], [0.4215, "Misconduct hearing for PC Rudvelle Walters @metpoliceuk The allegations include slapping a womans backside putting his hands down her knickers trying to kiss another woman and more whilst conducting a welfare check. police pc metpolice  "], [0.4404, "BREAKING; @DCPoliceDept and DCPS are investigating allegations of sexual misconduct at Ballou High School. @tomrousseynews will have more on how officials are working to keep students safe at  p.m.  MORE --&gt; "], [0.4588, "So last night @CPA_Bakes blocked me after I mentioned sexual misconduct in  from a CPS officer.Guess he only promotes PTSD help for those who are police officers.yyc yyccc"], [0.4753, "we will will do the rest! And I know this because WE HAVE AND continue rise  succeed. Ask not how government can compensate for the past harms to our ancestors but push it to do its job in its functions (combating police misconduct restoring voting rights protection etc)..."], [0.5267, "Or she jumped ship safeguarding a huge pension before she was caught  Unlike these;   "], [0.5423, "Interview: Outgoing BTP Federation Chair Nigel Goodband: Retiring BTP Fed Chair Nigel Goodband speaks frankly to Police Oracle about attrition rates and a concerning increase in misconduct cases. "], [0.5938, "The ones that solely believe police would never make any error and misconduct and also accepting whatever prosecutors presented as valid because hey  They're from the government. They are qualified.   These people needed to open their eyes fr."], [0.7269, "What the state can do to an innocent person. Some (incl TNZ funded by the govt) still like to talk about absence of corruption in NZ.One hopes (a) Hall is generously compensated  b) there is a serious indep inquiry into gross Police misconduct."], [0.7777, "If you are filming the escalating situation in SriLanka please refer to our tipsheet to safely and effectively film protests and police misconduct (Sinhala and Tamil versions coming soon!) -  GoHomeGota GoHomeGota "]]