[[-0.9885, "All patterns are same murder men enslave woman  children. Rape killing loots violence  inhumanity are true signs of any Islamic state. Above that all UN never did anything to stop supply of weapons to these retarded monsters. Weapon industry is flourished by terrorists. "], [-0.9794, "California has the most gun laws compared to any other state. Even with these regulations gun violence still occurs too often. California considers more laws to pass to reduce gun violence and the negative effects of gun violence in communities. LW "], [-0.9657, "BJP worker's murder in Chhendipada: Union Minister Dharmendra Pradhan blasts Odisha govt for failing to stop political violence even after Panchayat  Urban elections in the State. Police should take impartial action against the perpetrators of such violence says Pradhan"], [-0.9578, "Since youre saying global south LatAm experiences mad violence against women yet these killings arent referred to as honor killings Puerto Rico had to declare a state of emergency January  due to femicides yet the west doesnt call it honor killing "], [-0.9523, "Mnuuuuh yes the victims of a genocidal apartheid state are just like the Confederacy and the victims of centuries of institutional violence systemic racism and slavery are just like Ukrainians!Liberals stop being racist challenge  "], [-0.9485, "The incoming government of Nigeria and Kaduna State in  must end the terrorism in Kaduna. Its been almost a decade that Southern Kaduna has been continually terrorized. Going into/out of Kaduna is extremely difficult due to terrorism.Kaduna is a hotbed of violence"], [-0.9325, "In March of last year U.S. Secretary of State Antony Blinken accused forces from Amhara of committing 'acts of ethnic cleansing.' WesternTigray has seen some of the worst violence in the war' TigrayGenocide @EmilyThornberry @PreetKGillMP @SteveReedMP "], [-0.9325, "In March of last year U.S. Secretary of State Antony Blinken accused forces from Amhara of committing 'acts of ethnic cleansing.' WesternTigray has seen some of the worst violence in the war' TigrayGenocide @PreetKGillMP @SteveReedMP @EmilyThornberry  "], [-0.926, "If you are in any abusive situation call  Lagos State Domestic and sexual violence agencyIf you are not in Lagos call they will refer you.Their service is free and them go carry the matter pass you.  Domestic violence is a crime."], [-0.926, "Short on denial of people and destructive violence. The Tel Aviv municipality hung this map all over the city denying the existence of a people Palestinians who the Israeli state has attacked since its founding in .  "], [-0.9217, "“Russia is a terrorist state. Putin is a war criminal” Milewski said.We need to say so. UkraineJapan Most Strategic Partner to Help Avoid Rise of Violence in Ukraine Says Polish Envoy | JAPAN Forward "], [-0.9201, "Violence is a key health determinant- within a geopolitical context allows the identification of state/regional violence  the interrelated use of physical  sexual interpersonal violence key to health WHO Understanding Geopolitical Determinants of Health  "], [-0.9176, "Has Warnocks campaign blanketed the state with anti- Walker ads? Like his ignorance of the Constitution of the history of John Lewis fight for voting rights and of the Congress?  What about allegations of domestic violence  threatening behavior? "], [-0.9167, "People who were involved in NE Dilli riots haven't been brought to justice yet and we hear this... yet again. Until state does more violence and bring them to fear law we won't move anywhere. This will be a yearly affair. Every year more brutal than the previous one. "], [-0.9146, "EU countries: France Germany Italy and Spain decry the violence of Palestinians at the Temple in Jerusalem. They call for an unworkable two state solution which the Arabs have repeatedly rejected. Enough nonsense. Not ready for peace in our lifetime."], [-0.9119, "Worst @CMofKarnataka ever faced by Karnataka State. After he became @BSBommai CM Terror of the Saffron Terrorism beyond the bar their violence is extremely like Taliban activities which Sponsored  Promoted by @HMOKarnataka @narendramodi @PMOIndi @siddaramaiah @RahulGandhi "], [-0.9109, "Pakistan is a nuclear state. But Few are trying to make it a banana republic. Anyone who is inciting violence and civil unrest should be dealt with iron-hands. Law of the land should prevail. The fascist forces shall bite the dust InshaAllah."], [-0.9081, "Daily horror escalating in this country at an unfathomable pace. The violence in JNU campus to the fire which refuses to stop in Khargone. Mainstream news twisting the narrative as usual because it is the gaslighting tool of the state. I do not recognise this country anymore."], [-0.9072, "Can everyone categorically state that they are against violence and would not raise their hands against their spouse?  Also commit to report and stopping domestic violence   That's the way to start changing the tide against this menace  Zerotolerancefordomesticviolence"], [-0.9062, "Fascist thug Modi has mobilised all Hindu fascist goons across country in multiple states(Karnataka Goa MP UP Jharkhand …) to go on rampage  instigate violence everyday  These thugs are fast tracking moment of genocide with mercenaries in Media Judiciary State  Street."], [-0.9062, "Happening this morning…NYPD is once again destroying tents and belongings of our unhoused neighbors at the direction of fascist @NYCMayor.The foot soldiers for capitalism and the ruling class carrying out state violence. "], [-0.9062, "Indian Express @IndianExpress  shown spine by publishing article of Sonia Gandhi on state of communal violence hatred biogtry in New India of Modi ji. Now waiting for entire ecosystem of Godi Media ED CBI Income tax RSS to start attacking Indian Express and Sonia Gandhi."], [-0.9022, "A stable nation  society is build on the premise of state having complete monopoly over violence. The worst thing this govt has done is allowing mobs to run amuck. The silence of state on violence against minorities is nothing short of state sanctioned impunity. HateSpeech"], [-0.9022, "“Russia has a national sickness” “Its causes are authoritarianism corruption at every level of society poverty and state propaganda. Hatred of violence toward those who live differently democratically like Ukrainians is a symptom of their sickness "], [-0.8957, "Traffic violence is a criminal act that threatens the health safety and welfare of our citizens and should be treated as a crime.   Speeding car rams several pedestrians including child and Chicago police sergeant in Near North neighborhood "], [-0.8885, "We invite everyone to join us at the Open Assembly Against Pushbacks  Border Violence in Athens.We discuss border violence  state violence against migrants/refugees in Greece  plan actions and events.Sunday / @ :/:Protomagias Square (Pedion Areos park) "], [-0.886, "If the government tries to genocide queer people then optics no longer matter. It's a game of survival and in a game of survival vs the state you need to make the cost of attacking you as high as possible in order to deter aggression. That means violence. "], [-0.886, "RamnavamiRiotRowCongress  BJP are two sides of the same coin. Whether in Rajasthan MP or Gujarat the state governments have abated the people to create violence damage the properties  spread hatred: warispathanConverseIndia with RShivshankar "], [-0.8815, "News of violence from almost everywhere. Utter failure of the administration and state governments. Absolutely useless."], [-0.8807, "Hello @KTRTRS @hydcitypolice why this hatemonger is still not behind the bars ? He should  be arrested for spreading venom and hate in the name of religion and try instigate communal violence. Please arrest this insect before he disturb the peace in our city and state. "], [-0.8802, "Either you break the constitutionincite violence use religion card or call someone a traitor. The state will not bow down to you democracy will live and prevail. The empire of incompetence  selected puppets is collapsing bit by bit. Jiya Jamhooriyatjiye constitution!!"], [-0.8779, "By demolishing some illegal buildings MP govt has very quickly diverted the attention from Khargone violence. No answers on how  why state police  intelligence failed caught sleeping while so much build up took place. @ChouhanShivraj @drnarottammisra"], [-0.875, "An exhibit featuring six stories of survivors of sexual assault will be the first project the Center for Sexual and Relationship Violence Support Services displays in recognition of Sexual Assault Awareness Month. "], [-0.875, "They are both a bit of play acting to distract you from the fact that conservatism is categorically opposed to correcting for causes and prefers instead to use state violence to wreak havoc on the victims of their committed inaction."], [-0.875, "You can be both.To deny that is philosophically ignorant.Defense of life sometimes means protecting innocent life from violence with the threat or application of violence.Its our nature.Its our fallen state. "], [-0.872, "BJP workers in West Bengal still could not come to their homes open their shops start farm work after post poll violence Neither State Leadership Nor Central Leadership sorted out their problem till today Shame on BJP surrendered to TMC GOONS @narendramodi @AmitShah @SuvenduWB"], [-0.8625, "The colonial Israeli state has been engaged in a full-on rampage against Palestinians brutalizing and murdering at will. This is the violence of settler-colonization. This is exactly what is sanctioned when people ignore/silence Palestinians or act like BDS is too “radical.”"], [-0.8608, "State of these fucking animals. Where is the outcry tho? They could find m for Notre Dame in a day but they cant even find the energy to condemn Israeli violence. We see yall. "], [-0.8553, "In recent Jahangirpuri violence by Ms. It's evident fact that state is incapable of protecting hs. Don't let state fool you. Indian state can be paralysed by street violence."], [-0.8513, "Abolish conversion therapy! All or nothing! We will defend ourselves against state sanctioned violence towards trans people through excluding us from the conversion therapy ban. "], [-0.8442, "This is what good people fail to understand.And the threat of state violence means nothing will ever happen even if they should come to understand this one day. "], [-0.8402, "If Hindus does violence at Muslim Area in BJP states Like Guj and MP they blame MuslimsIf Muslims does violence at Muslim Area in Non-Bjp state like Delhi they blame Kejriwal... that's it ..DelhiRiots"], [-0.8316, "This strike is the st in the country in decades.  The fear is that the state will resort to violence  target these fishermen.SaudiArabia "], [-0.8303, "My tweets are in no way a result of Imran Khan's anti-US rhetoric. I totally disagree with IK's anti-US/EU stance. My sentiments just got boiled over witnessing a state-sponsored violence against Muslims in India. And US is inviting Hindia's DEF and FRN ministers for a meeting!!!"], [-0.8271, "This whole thread is documenting the actions of a fascist capitalist dystopia. When are people going to push back against state-sponsored violence? "], [-0.8225, "'American Traditions' Magnet  Modern American culture is a complex melting pot of old struggles and divisions set upon a canvas of modern technology paranoia and violence by the state against its"], [-0.8225, "The Israeli state is an apartheid state and operates constant harassment violence and unremitting interference in the lives of Palestinians. HumanRights "], [-0.8176, "Sexual violence at the hands of the state is pervasive in Egypt. Our report documents hundreds of cases where it was used to harass coerce and intimidate prisoners  their loved ones. "], [-0.8176, "Strongly protest US's + with a Hindu-nationalist India. The US is a diverse pluralist state where I've seen Muslims praying in a Synagogue. But India as a state is a patron to the violence meted out to Muslims and the destruction of their worshipping places in the country."], [-0.8126, "Which is why the state monopoly on violence cannot work in India just like the USA the citizens must have the right to own personal protection weapons. Illegally the other community does keep weapons and explosives. "], [-0.7906, "Palestinians in Jenin evoke painful past as violence flares - state_of_palestine international united_states palestinians saudi_arabia gaza_strip west_bank israel jordan jenin chile qatar syria "], [-0.7884, "Violence at JehangirPuri on hanumanjanmotsav is proof:-. Repeatation of DelhiRiots . Kejriwal is communist with no care for HinduLives . PFI is radicalising more before its ban. Central Govt reacts seldomly in Delhi  not in any other stateHinduUnderAttack"], [-0.7853, "In African thinking if things dont work out or go your way there is always the option of stealing or violence .   Blacks have never been worried about the state of the country or the future because they know they will do anything to survive for eg looting and mugging ."], [-0.7834, "If seeing innocent people have their homes dreams dignity  lives destroyed in Ukraine got you angry about the injustice of state-sponsored violence—I hope youre bringing that same indignation to whats happening in Jerusalem now.Otherwise it wasnt really about justice."], [-0.7783, "'American Traditions' Racerback Tank Top  Modern American culture is a complex melting pot of old struggles and divisions set upon a canvas of modern technology paranoia and violence by the state"], [-0.765, "We renew our call on all armed actors to renounce  end human rights abuses  violence against civilians. The US reiterates its call for all foreign forces to withdraw from Ethiopia as well as regional state to remove their forces from neighboring regions. "], [-0.765, "Why does @amnesty @hrw @BBCAfrica @CNN @nytimes ignore state violence against Oromos (+ Million) in Ethiopia?  @hrw @UNHumanRights @AJEnglish @UNICEFUSA @UN_HRC @AmnestyEARO @USEmbassyAddis @StateDept HumanRightsForOromo OromoVoice"], [-0.765, "Why does @amnesty @hrw @BBCAfrica @CNN @nytimes ignore state violence against Oromos (+ Million) in Ethiopia?  @hrw @UNHumanRights @AJEnglish @UNICEFUSA @UN_HRC @AmnestyEARO @USEmbassyAddis @StateDept HumanRightsForOromo OromoVoice "], [-0.7587, "This violence isn't natural it is imposed by the State."], [-0.7579, "The state has monopoly on violence. It points its finger at unlawful people smugglers whilst launching its own (lawful?) trafficking scheme. "], [-0.743, "The state sanctioned impunity afforded to ABVP's violence must end. The goons have no place within a university campus."], [-0.7351, "This report assesses the state of knowledge on the intersections between natural disasters and political violence based on a systematic and extensive review of the existing scientific literature "], [-0.7351, "global attention western lead proxy war in ukraine against russia.  well the zionist state so-called Israel continued blood terror genocide against people of profeta jesus. Palestine.  "], [-0.7346, "Your hate for modi is so much that you can not see whome you are supporting in the opposition if this kind of violence had happened in bjp ruled state you would hv gone to UN by now.@ARanganathan  "], [-0.7269, "First start from your home .Rajatstan where communal violence occured is ruled by Congress .Sadhus are lynched in maharastra which honourable pawar represents . Mamata's goons perpetrated unimaginable violence . Do start there . Law and order is state subject . "], [-0.72, "Its behavior like this thats totally unacceptable and that have turned New York into Gotham city lack of kindness and the need to violence by the residents of New York is sad and destroying this great state "], [-0.7184, "Muslims shouldnt get into nuances of not being shown as aggressors by media while defending their life and property. No law in the world cancels the right to defence  Hindutava terrorísts have unleashed planned violence against IM with state support and world is silently watching"], [-0.7123, "Shahbaz and Hamza are now in the chief executive positions. All excuses end now. The violence that PTI is indulging in needs a crushing response. Dont delay it! Get your cabinet up and running and establish the states writ."], [-0.694, "OHANAEZE YOUTH COUNCIL CONDEMN VIOLENCE DURING PDP PARTY MEETINGSacross the state "], [-0.6662, "Where do you run from state sanctioned violence? Resistance is our right as citizens. What ABVP goons did today at JNU campus is what this country will be turned into of we don't wake up from the slumber? ArrestSanghiGoons"], [-0.6597, "Anyone have a stat on how many deaths all countries create that didnt need to happen like by state violence (bombings sanctions police and wars) and inequality (hunger cold inability to escape abusive situations)? I get the feeling the usa would top the list.."], [-0.6597, "Lets call this what it is: transgender refugees fleeing political persecution and state violence. When trans people say there is a transgender genocide going on we're serious - they seek to eliminate us from all aspects of life and end trans children."], [-0.6486, "Nonprofits awarded grants to expand services  to victims of family violence and sexual assault by State of Indiana "], [-0.6378, "This is really fascinating to look at through the lenses of abolitionism and abolitionist geography: the death of distance NIMBYism state violence and gentrification. "], [-0.6369, "A state that can establish what is true (WMDs in Iraq) is a state that can justify violence. It is in this sense that decentralized cryptographic truth is the ultimate check on every abusive state...  "], [-0.6369, "In  Montana lawmakers passed permitless carry. This huge spike in gun violence in the states cities is the logical outcome of Republicans actions. mtleg "], [-0.6369, "the youth were legitimate reformists who had had enough of their (Islamic) clergys hypocrisy while the other (GoK-allied clergy) which ultimately became mainstream accused them of pursuing a hidden external “extremist” agenda to create a state of anarchy through violence. "], [-0.6249, "Calculated state violence against LGBTQ folk. Thats what were now seeing."], [-0.6249, "In RamNavami rally Hyderabad calling for establishment of a Hindu state along with calls of violence were raised  “Har minar pe lagaenge Hindu ka jhanda” “talwar uthega” Jo Ram ka naam na le usko Bharat se bhagana hain: BJP RajaSingh  @KTRTRS @TelanganaDGP Pl take action "], [-0.6249, "Report to the ministry of women Affairs in the state. Or approach any NGO that handle the affairs of Womendomestic violence and Child's welfare. Any of these two entities would take it up. "], [-0.6249, "Resist state violence with Bitcoin "], [-0.6249, "Resistance Lab DatasetsA collection of data and tools exploring UK state violence "], [-0.6249, "State-sanctioned violence. "], [-0.6249, "The violence in the state should be reminded from the state Or the CM will was many consequences"], [-0.6249, "The violence in the state should be reminded from the state Or the CM will was many consequencesShivraj Ka Rajdand "], [-0.6249, "The violence in the state should be reminded from the state Shivraj Ka Rajdand "], [-0.6249, "The violence really has been in the state should be reminded from the state Shivraj Ka Rajdand "], [-0.6249, "The viral video is old from October  when the northeastern state of Tripura witnessed widespread violence in which several mosques and Muslim houses were vandalised.factcheck tripura muslims communal oldvideo"], [-0.6249, "This is entitlement. They can't hold the state hostage and not face any consequences. Those inciting violence and civil unrest must not go unpunished. PunjabAssembly "], [-0.5422, "Any electoral gains for the European far right should strike terror in anyone not wanting their violence  hate to hold power in Europe again. Extremely worrying what this says about the state of French society. Macron must win or France and Europe is in deep trouble. "], [-0.4767, "Pu Ramthanmawia MLAChairman SEDP today revealed that the Central Government which asked the state to push back displaced Myanmar nationals who fled violence in their country post-FebCoup havafter much persuasion now sanctioned Rs. crore relief for their rehabilitation. "], [-0.4588, "The State Department said on Sunday it was concerned about violence in El Salvador as well as recently passed legislation that criminalizes reporting on some gang activities. Last Tuesday the El S…... "], [-0.4215, "The 'peaceful' lot yet again disrupts peace in Delhi on the occasion of Hanuman Jayanti. Earlier violence on Rama Navami in many states. It happens only because the state has been accomodating aggression in the name of 'Allah hu Akbar' for bogus pluralism."], [-0.4215, "When fresh allegations of domestic violence were lodged against former Missouri Gov. Eric Greitens last month one of his Republican rivals for the states open Senate seat Rep. Vicky Hartzler stepped up and called for him to end his campaign. "], [-0.4129, "Ahead of the Ram Navami violence in Karauli Popular Front Of India had alerted the Rajasthan State govt About the Hindutva vile plans But they didnt pay heed.ResistAntiMuslimViolence IndiaWithPFI"], [-0.4129, "Ahead of the Ram Navami violence in Karauli Popular Front had alerted the Rajasthan State govt. about the Hindutva vile plans. But they didnt pay heed. ResistAntiMuslimViolence IndiaWithPFI"], [-0.4129, "Ahead of the Ram Navami violence in Karauli Popular Front had alerted the Rajasthan State govt. about the Hindutva vile plans. But they didnt pay heed. ResistAntiMuslimViolence IndiaWithPFI "], [-0.3927, "If the choice is between supporting the well-funded violence of the state and the justified rage of the oppressed its clear what side we have to be on.Don't let Ukraine's war distract you from the particulars. "], [-0.296, "Thread: .Clearly @SecBlinken has no better things to do at the moment that to attack the US ally ElSalvador on free speech as @nayibbukele follows legal procedures in arrests of gang members responsible for a murder spree.  "], [-0.2481, "US is losing all the love and admiration for its values-based system. US is hurting sentiments of the moderate liberal voices who aspire to do  be what the US stands for. US is pampering India a Hindu-nationalist and extremist state that patronizes violence against Muslims!"], [-0.2363, "violence can never be justified be it from PMLN PTI or any other political party - or human for that matter. support whoever you like but dont be blind cult followers. sad state of affairs "], [-0.2023, "Violence and Threats to Free Speech in El Salvador - United States Department of State "], [-0.079, "Because &gt; the facts state You're more like this when You cause Animals suffering &gt; Or are You Pro~Life   "], [-0.0772, "interesting deconstruction or theory of the 'meta-state' as a 'radical shift in the way humans make violence predictable'. this could well explain the inherent logic of the 'stakeholder capitalism' movement to transcend old industrial capitalism and territorial nation states. "], [-0.0654, "incorrect-hermitcraft: Wels: Youve heard the States concerns about your criminal history and your potential for violence if released. What would you like the judge to consider when resolving your case? Scar: Ive never done a violent thing... "], [-0.0516, "You may expect liberals to be horrified but keep in mind what they watch on TV. They love shit like this this is the violence of their hearts' desire and the State Dept knows how to sell it. "], [0.0772, "My research as well as other studies confirm that the peasants of Colombia and their subsistence economies have survived more than  decades of the state's violence and its paramilitaries groups onslaught."], [0.128, "LRT WHAT IF OMI-OMI ONLY GRUMPY ALL THE TIME CAUSE HE'S A SECRET SOFTIE WHO FINDS EVERYTHING ADORABLE  ENDEARING.SO HE'S JUST IN A CONSTANT STATE OF AGGRESSIVE AFFECTION.LIKE GRRRRR I CRAVE VIOLENCE. MUCH SQUISH. TOO CUTE."], [0.1531, "“Instead of receiving support my neighbors are vilified for wanting this to end. When we try to advocate we risk getting frozen out by the city state or whoever simply for saying whats obvious to everyone here: Current strategies are not working.” "], [0.2023, "“Clashes” and what “sparked the violence” when it is clear the apartheid terrrst state that is Israel is the aggressor and always has been "], [0.3182, "The United States shall guarantee to every State in this Union a Republican Form of Government and shall protect each of them against Invasion; and on Application of the Legislature or of the Executive (when the Legislature cannot be convened) against domestic Violence."], [0.3291, "Well isnt that whats she paid for? The more students under perform the more  money gets thrown to the cityby the state and federal to fix the problem but instead salaries increased thus continues the never ending cycle of corruptionviolence and Drug use "], [0.3818, "The State governments like that of M.P played an active role in the anti-Muslim violence during Ram Navami rallies. They demolished Muslim properties calling innocent Muslim victims rioters. ResistAntiMuslimViolence IndiaWithPFI"], [0.4936, "Despite profound gratitude for her freedom Pam still feels the affects of state sanctioned violence. Let's heal communities and families with restorative justice and let's start by doing the right thing now for an innocent woman. freemelissalucio  "], [0.5326, "It's so shameful how criminal remarks like this don't warrant state action. Hezbollah is enabling false narratives actively erasing Lebanon's image and consistently deterring Lebanon from reconstruction in neutrality.   The goal isn't violence. it is peace. "], [0.567, "My tweets are being deleted by Twitter God knows WHY? Let me state it all clear that we as a nation may have amnesia be clear we will never forget what PTI has done to the rule of law  constitution in . Cherry on top is inciting violence   propagating civil unrest."], [0.5773, " Golden State Warriors head coach Steve Kerr says moments of silence wont solve gun violence "], [0.6408, "During her time in the state legislature Madeline founded and served as co-chair of the PA SAFE Caucus a group of legislators dedicated to ending gun violence.”  Madeline Dean PA @RepDean    ResistanceUnited "], [0.6908, "We cannot continue basing all world systems on nation state violence-based financial systems.  We either choose to change or the ClimateCrisis will change us.  To prepare please study @LeanDictionary we will need the wisdom contained therein. "], [0.7248, "“Law enforcement determined (Trump) and (Greene) played a substantial role in promoting and influencing their followers to create this disorder with a propensity for violence”   Hah Made you look… as if:  Florida the state of hypocrisy "], [0.7269, "Delhi CM ArvindKejriwal said it is the Centre's responsibility to ensure peace is maintained in the national capital."], [0.8354, "I know Mick and Clare personally both of them are very good people and politicians.Neither Mick or Clare have or would ever support any form of violence.This war is terrible but I will always have good respect for Wallace and Daly. "], [0.8413, "Governor of WB has to realize that people of WB are very in full favour of ruling party  un favour the any communal party whose work is to be blame the ruling govt by creating problems  violence in state.This must be stopped. CM must look into this to maintain peace  harmony. "], [0.8442, "Thank you Coach Kerr for continuing to take action to EndGunViolence. Your dedication to this movement will help us create a safer America. @warriors @bradybuzz' ' "], [0.8481, "Join Delaware State University and Local and National Organizations dedicated to social justice at the Creating Safe Spaces: Promoting Wellness and Disrupting Sexual Assault and Intimate Partner Violence event on April th AM-PM. Register here: "], [0.891, "Ever notice how duopoly politicians issue statements like “violence is never the answer” for violence here but when it comes to their masters—the blob the -profit Natl Security  Surveill. State—theyre like “to keep our global dominance we can never have ENOUGH violence?” "]]