{
  "police brutality": [
    "Wed Jun 03 2020 New York City, New York - Police shove protesters WATCH: https://t.co/Iybb9HBbhe City #NewYork CityNew York #NYCPD #blacklivesmatter #blm #defundthepolice #abolishthepolice",
    "Police Brutality is worst in Nigeria rn,\nMy Taxify guy last week was hit by Police team from the back, he parked to complain and the use baton to break his head... People wey suppose dey protect https://t.co/DRW0o2GSy0",
    "Until we end capitalism, the racist violence of this system won’t change in significant ways. What HAS changed, is the consciousness of people who have participated in struggles against police brutality. This is where people begin to feel their power.\n\nhttps://t.co/GFP6bpkFCK",
    "Higher Education Campuses should start with these two levers of change to address police brutality:\n1️⃣ Use existing contracts to demand reform from police departments\n\n2️⃣Colleges should reexamine how they manage their own campus police \n\nhttps://t.co/igWVRzGOpc.",
    "North are facing bandits/Terrorists, south are facing Police brutality/EFCC/NDLEA when you protest now they will say you want to destabilize the country, no where it's safe in this so called hell country. Make God help us 😥😫\n#JusticeforAbiola https://t.co/XSq2vhpvZB",
    "Same thing happened to my brother and I'll  be happy If this woman gets justice for her son,police brutality is common ekasi #SkhiphaAmafiles",
    "2020\nASUU strike ✅ \nPolice brutality in Osun ✅ \nEnd Sars protest \n\n2022\nASSU strike ✅ \nPolice brutality in Osun ✅ \nASUU strike ⏳\n\nAre you thinking what I’m thinking 🤔 #Justiceforabiola",
    "French police brutality under scrutiny https://t.co/s4yLiCiAlv via @YouTube",
    "#JusticeForAbiola\n\nWe are tired of police brutality, extortion and harassment in Osogbo.",
    "“Police Brutality” noted in the medical records. \nAre police appointed to protect us? Or hurt us?\nDoes the police support safety of common man? Or provides immunity to the Govt that cheats the common man? @MahilaCongress @TelanganaPMC @INCTelangana @revanth_anumula https://t.co/pou6NqmSjA"
  ],
  "will smith": [
    "Free Will Smith https://t.co/FFmMXQ8nTX",
    "Twitter went nothing but euphoria posts to will smith to tit pics in like a month lmfao",
    "Oscars governors discuss sanctions for Will Smith over slap https://t.co/mCuE6KmfQA",
    "I find it wrong that BET &amp; VH-1 have been constantly playing Will Smith shows/movies after he assaulted Chris Rock. Why are you not playing any Chris Rock films? Did Scientology pay you to promote Will?",
    "I hope my guy Will Smith doing cool today",
    "JUST IN!!! @Will Smith Enters Luxury REHAB! | Here's WHY! https://t.co/fcxLnPjZi6 via @YouTube",
    "“We are seeing increased incidents of what I will call probing,” said David Smith, director of Air Force Plant 42, where Northrop Grumman is building the service's new stealth bomber, the B-21 Raider.\n\nFWIW if I live nearby I would certainly be probing. https://t.co/39xt1KSoKi",
    "It feels almost like a Will Smith subtweet… https://t.co/rfj65pfc2H",
    "Support Ukraine Free music Peace 4 Ukraine \"Ronnie Jackson\" #music #Spotify, ##Will Smith, #YouTube, #instagram, #music connection, #entertainment, #NAMM 2022. https://t.co/hm0my1ZJB7 ##https://musicmon.wixsite.com/americansolormusic https://t.co/hm0my1ZJB7"
  ]
}